<a href="https://colab.research.google.com/github/luisbezerra1/Data-Science-/blob/master/Criando_nova_variavel.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd

In [0]:
dados = pd.read_csv('aluguel.csv',sep=';')

In [4]:
dados.head(10)

                      Tipo           Bairro  ...  Condominio    IPTU
0                Quitinete       Copacabana  ...       500.0    60.0
1                     Casa  Jardim Botânico  ...         NaN     NaN
2  Conjunto Comercial/Sala  Barra da Tijuca  ...      4020.0  1111.0
3              Apartamento           Centro  ...       390.0    20.0
4              Apartamento     Higienópolis  ...       230.0     NaN
5              Apartamento     Vista Alegre  ...         NaN     NaN
6              Apartamento         Cachambi  ...       301.0    17.0
7       Casa de Condomínio  Barra da Tijuca  ...         NaN     NaN
8       Casa de Condomínio            Ramos  ...         NaN     NaN
9  Conjunto Comercial/Sala           Centro  ...     19193.0  3030.0

[10 rows x 9 columns]

In [0]:
dados['Valor_Bruto'] = dados['Valor'] + dados['Condominio'] + dados['IPTU']

In [6]:
dados.head()

                      Tipo           Bairro  ...    IPTU  Valor_Bruto
0                Quitinete       Copacabana  ...    60.0       2260.0
1                     Casa  Jardim Botânico  ...     NaN          NaN
2  Conjunto Comercial/Sala  Barra da Tijuca  ...  1111.0      10331.0
3              Apartamento           Centro  ...    20.0       1210.0
4              Apartamento     Higienópolis  ...     NaN          NaN

[5 rows x 10 columns]

In [0]:
dados['Valor_M2'] = (dados['Valor'] / dados['Area']).round(2)

In [8]:
dados.head()

                      Tipo           Bairro  ...  Valor_Bruto  Valor_M2
0                Quitinete       Copacabana  ...       2260.0     42.50
1                     Casa  Jardim Botânico  ...          NaN     70.00
2  Conjunto Comercial/Sala  Barra da Tijuca  ...      10331.0     34.67
3              Apartamento           Centro  ...       1210.0     53.33
4              Apartamento     Higienópolis  ...          NaN     16.67

[5 rows x 11 columns]

In [9]:
dados.Valor_M2.dtype

dtype('float64')

In [0]:
casa = ['Casa','Casa de Condomínio','Casa de Vila ']

In [0]:
dados['Tipo de Moradia'] = dados['Tipo'].map(lambda x: 'Casa' if x in casa else 'Apartamento')

In [12]:
dados

                          Tipo                Bairro  ...  Valor_M2  Tipo de Moradia
0                    Quitinete            Copacabana  ...     42.50      Apartamento
1                         Casa       Jardim Botânico  ...     70.00             Casa
2      Conjunto Comercial/Sala       Barra da Tijuca  ...     34.67      Apartamento
3                  Apartamento                Centro  ...     53.33      Apartamento
4                  Apartamento          Higienópolis  ...     16.67      Apartamento
...                        ...                   ...  ...       ...              ...
32955                Quitinete                Centro  ...     29.63      Apartamento
32956              Apartamento           Jacarepaguá  ...     23.08      Apartamento
32957              Apartamento  São Francisco Xavier  ...     29.17      Apartamento
32958              Apartamento                Leblon  ...     42.86      Apartamento
32959  Conjunto Comercial/Sala                Centro  ...     26.00      Apartamento

[32960 rows x 12 columns]

Excluindo variaveis / Colunas

In [0]:
dados_aux = pd.DataFrame(dados[["Tipo de Moradia",'Valor_M2','Valor_Bruto',]])

In [14]:
dados_aux

      Tipo de Moradia  Valor_M2  Valor_Bruto
0         Apartamento     42.50       2260.0
1                Casa     70.00          NaN
2         Apartamento     34.67      10331.0
3         Apartamento     53.33       1210.0
4         Apartamento     16.67          NaN
...               ...       ...          ...
32955     Apartamento     29.63       1175.0
32956     Apartamento     23.08       2640.0
32957     Apartamento     29.17       1946.0
32958     Apartamento     42.86          NaN
32959     Apartamento     26.00      11815.0

[32960 rows x 3 columns]

In [18]:
dados.Tipo.unique()

array(['Quitinete', 'Casa', 'Conjunto Comercial/Sala', 'Apartamento',
       'Casa de Condomínio', 'Prédio Inteiro', 'Flat', 'Loja/Salão',
       'Galpão/Depósito/Armazém', 'Casa Comercial', 'Casa de Vila',
       'Terreno Padrão', 'Box/Garagem', 'Loft',
       'Loja Shopping/ Ct Comercial', 'Chácara', 'Loteamento/Condomínio',
       'Sítio', 'Pousada/Chalé', 'Studio', 'Hotel', 'Indústria'],
      dtype=object)

In [20]:
dados['Tipo'].value_counts()

Apartamento                    19532
Conjunto Comercial/Sala         6815
Loja/Salão                      1426
Casa de Condomínio               996
Casa                             967
Quitinete                        836
Galpão/Depósito/Armazém          623
Flat                             476
Prédio Inteiro                   301
Casa Comercial                   265
Casa de Vila                     249
Loja Shopping/ Ct Comercial      247
Box/Garagem                       82
Terreno Padrão                    70
Loft                              51
Sítio                             10
Loteamento/Condomínio              5
Studio                             4
Hotel                              2
Indústria                          1
Chácara                            1
Pousada/Chalé                      1
Name: Tipo, dtype: int64